import pandas as pd

data = pd.read_excel('major_data.xlsx')
print(data.columns())

human = ['언어/문학', '인문학', '경영/경제', '법학', '사회과학', '교육', '농림/수산', '화학/생명/과학/환경',
'생활과학', '수학/물리/천문/지구', '간호', '보건', '약학', '의료예과', '교육', '전기/전자/컴퓨터', '건설', '산업/안전', '재료', '기계', '화공/고분자/에너지', '공학교육', '무용/체육', '연극/영화', '응용예술', '미술', '음악', '예체능교육', '의료']
science = ['농림/수산', '화학/생명/과학/환경', '생활과학', '수학/물리/천문/지구', '간호', '보건', '약학', '의료예과', '교육']
engneer = ['전기/전자/컴퓨터', '건설', '산업/안전', '재료', '기계', '화공/고분자/에너지', '공학교육']
medical = ['의료']
art = ['무용/체육', '연극/영화', '응용예술', '미술', '음악', '예체능교육']

